Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Alternatively, if you only need to enable this feature for individual endpoints, create a custom filter like in the example below:
ja_jp: あるいは、個々のエンドポイントでのみこの機能を有効にする必要がある場合は、以下の例のようにカスタムフィルターを作成します。

source: Alternatively, if you only need to enable this feature for individual endpoints, create a custom filter, as in the following example:
ja_jp: あるいは、個々のエンドポイントでのみこの機能を有効にする必要がある場合は、以下の例のようにカスタムフィルターを作成します。

source: Alternatively, if you only need to set the status code and / or HTTP headers with static values, you can use `@org.jboss.resteasy.reactive.ResponseStatus` and /or `ResponseHeader` respectively. An example of this could look like:
ja_jp: または、静的な値でステータスコードや HTTP ヘッダーのみを設定する必要がある場合は、それぞれ `@org.jboss.resteasy.reactive.ResponseStatus` および/または `ResponseHeader` を使用できます。この例は次のようになります。

source: Alternatively, if you prefer to start with the completed example, clone the Git repository: `git clone {quickstarts-clone-url}`, or download an {quickstarts-archive-url}[archive].
ja_jp: あるいは、完成した例から始める場合は、Git リポジトリーをクローン (`git clone {quickstarts-clone-url}`) するか、{quickstarts-archive-url}[アーカイブ] をダウンロードします。

source: Alternatively, if you use an the xref:security-authorize-web-endpoints-reference.adoc#authorization-using-configuration[HTTP Security policy] to secure the endpoint, then, for the `@Tenant` annotation be effective, you must delay this policy's permission check as shown in the following example:
ja_jp: または、xref:security-authorize-web-endpoints-reference.adoc#authorization-using-configuration[HTTP セキュリティーポリシー] を使用する場合 エンドポイントを保護するには、`@Tenant` アノテーションを有効にするために、次の例に示すように、このポリシーの権限チェックを遅延する必要があります。

source: Alternatively, it is possible to select path-specific authentication mechanism with HTTP Security Policy:
ja_jp: または、HTTP セキュリティーポリシーを使用してパス固有の認証メカニズムを選択することもできます。

source: Alternatively, one can jump directly into a privileged shell (root on the host), and execute a `ps` command directly:
ja_jp: また、特権シェル（ホスト上のroot）に直接ジャンプして、 `ps` コマンドを直接実行することもできます:

source: Alternatively, prefer the use of constructor injection which works without modification of the Java examples, increases testability and complies best to a Kotlin programming style.
ja_jp: あるいは、Javaの例を変更せずに動作し、テスト性が高く、Kotlinのプログラミングスタイルに最も適しているコンストラクタ・インジェクションの使用をお勧めします。

source: Alternatively, run the following {openshift} command-line interface (CLI) commands:
ja_jp: あるいは、以下の {openshift} コマンドライン・インターフェイス (CLI) コマンドを実行します：

source: Alternatively, there is some unofficial link:https://plugins.gradle.org/search?term=jandex[Gradle Jandex plugins] that can be used instead of the `META-INF/beans.xml` file.
ja_jp: あるいは、 `META-INF/beans.xml` ファイルの代わりに使える非公式の link:https://plugins.gradle.org/search?term=jandex[Gradle Jandex プラグイン] もあります。

source: Alternatively, this https://code.quarkus.io/?a=quarkus-mailer-getting-started&nc=true&e=resteasy-reactive&e=qute&e=mailer&extension-search=mail[link] pre-configures the application. Click on "Generate your application", download the zip file and unzip it on your file system. Open the generated project in your IDE. In a terminal, navigate to the project and start dev mode:
ja_jp: あるいは、この https://code.quarkus.io/?a=quarkus-mailer-getting-started&nc=true&e=resteasy-reactive&e=qute&e=mailer&extension-search=mail[リンク] からアプリケーションを事前に設定することもできます。"Generate your application" をクリックして、ZIPファイルをダウンロードし、お使いのファイルシステムで解凍します。生成されたプロジェクトをお使いのIDEで開きます。ターミナルで、プロジェクトに移動し、devモードを開始します。

source: Alternatively, to generate stubs for `proto` files, you can use the `protobuf-maven-plugin`. However, it's recommended to use Quarkus support unless you have a specific need.
ja_jp: または、 `proto` ファイルのスタブを生成するには、 `protobuf-maven-plugin` を使用できます。 ただし、特別なニーズがない限り、Quarkus サポートを使用することを推奨します。

source: Alternatively, use SNI to select the appropriate certificate and private key. Note that all keys must use the same password.
ja_jp: または、SNI を使用して適切な証明書と秘密鍵を選択します。 すべてのキーに同じパスワードを使用する必要があることに注意してください。

source: Alternatively, use a Java record that implements `io.quarkus.mailer.MailTemplate`. The record components represent the template parameters.
ja_jp: あるいは、 `io.quarkus.mailer.MailTemplate` を実装する Java レコードを使用します。 レコード・コンポーネントはテンプレート・パラメータを表します。

source: Alternatively, use a default or custom UserInfo cache provider, please see the xref:security-oidc-bearer-token-authentication.adoc#bearer-token-token-introspection-userinfo-cache[Token Introspection and UserInfo cache] section of the "OpenID Connect (OIDC) Bearer token authentication" guide.
ja_jp: または、デフォルトまたはカスタムの UserInfo キャッシュプロバイダーを使用します。OpenID Connect (OIDC) Bearer トークン認証ガイドの xref:security-oidc-bearer-token-authentication.adoc#bearer-token-token-introspection-userinfo-cache[トークンイントロスペクションと UserInfo キャッシュ] セクションを参照してください。

source: Alternatively, we can list the backtraces of all threads with a single command:
ja_jp: または、1 つのコマンドですべてのスレッドのバックトレースを一覧表示することもできます。

source: Alternatively, you can allow the same unsafe behavior, but with warnings when it takes effect:
ja_jp: または、そのような安全でない動作を許可し、その動作が有効になったときに警告を記録することもできます。

source: Alternatively, you can also provide a custom redirect handler for all your REST Clients via CDI:
ja_jp: または、CDI 経由ですべての REST Client にカスタムリダイレクトハンドラーを提供することもできます。

source: Alternatively, you can annotate your method with `@io.smallrye.common.annotation.Blocking`:
ja_jp: あるいは、メソッドに `@io.smallrye.common.annotation.Blocking` アノテーションを付けることもできます。

source: Alternatively, you can bind custom named HttpSecurityPolicy to Jakarta REST endpoints with the `@AuthorizationPolicy` security annotation.
ja_jp: または、 `@AuthorizationPolicy` セキュリティーアノテーションを使用して、カスタム名 HttpSecurityPolicy を Jakarta REST エンドポイントにバインドすることもできます。

source: Alternatively, you can change the default behaviour within MacOS Docker Desktop to use `localhost` when binding ports. Inside the Docker Desktop, go to `Settings > Resources > Network > Port Binding Behaviour` and change it to `localhost by default`. Be aware that this change is applied to all docker containers, and may have unforeseen side affects. Update to the latest version of Docker if you do not see this Docker Desktop option.
ja_jp: あるいは、macOS の Docker Desktop 内で、ポートをバインドする際に `localhost` を使用するようにデフォルトの動作を変更することもできます。Docker Desktop 内で、`Settings > Resources > Network > Port Binding Behaviour` に移動し、`localhost by default` に変更します。この変更はすべての Docker コンテナーに適用され、予期せぬ副作用がある可能性があることに注意してください。この Docker Desktop オプションが表示されない場合は、Docker の最新バージョンに更新してください。

source: Alternatively, you can configure the algorithms globally by using the following properties:
ja_jp: または、次のプロパティーを使用してアルゴリズムをグローバルに設定することもできます。

source: Alternatively, you can configure the signature algorithm globally with the following property:
ja_jp: または、次のプロパティーを使用して署名アルゴリズムをグローバルに設定することもできます。

source: Alternatively, you can configure the tenant `tenant-a` directly in `application.properties`:
ja_jp: または、`application.properties` で直接テナント `tenant-a` を設定することもできます。

source: Alternatively, you can create a quarkus extension and register the proxy classes as described in <<managing-proxy-classes-extension>>.
ja_jp: または、quarkus エクステンションを作成し、プロキシークラスを <<managing-proxy-classes-extension>> で説明されているように登録することもできます。。

source: Alternatively, you can declare your template parameters in the template file itself.
ja_jp: あるいは、テンプレートファイル自体でテンプレートパラメーターを宣言することもできます。

source: Alternatively, you can define a xref:cdi.adoc#ok-you-said-that-there-are-several-kinds-of-beans[CDI bean producer] for the beans of the default persistence unit. This bean producer redirects to the currently active named persistence unit. This allows beans to be injected directly, as shown below:
ja_jp: あるいは、デフォルトの永続化ユニットの Bean 用に xref:cdi.adoc#ok-you-said-that-there-are-several-kinds-of-beans[CDI Bean プロデューサー] を定義することもできます。この Bean プロデューサーは現在アクティブな名前付き永続化ユニットにリダイレクトします。これにより、以下に示すように Bean を直接注入できるようになります。

source: Alternatively, you can define a xref:cdi.adoc#ok-you-said-that-there-are-several-kinds-of-beans[CDI bean producer] for the default datasource. This bean producer redirects to the currently active named datasource. This allows it to be injected directly, as shown below:
ja_jp: あるいは、デフォルトのデータソース用に xref:cdi.adoc#ok-you-said-that-there-are-several-kinds-of-beans[CDI ビーンプロデューサー] を定義することもできます。このビーンプロデューサーは、現在アクティブな名前付きデータソースにリダイレクトします。これにより、以下のように直接注入することができます：

source: Alternatively, you can disable ryuk:
ja_jp: または、ryuk を無効にできます:

source: Alternatively, you can enable the Application-Layer Protocol Negotiation (alpn) TLS extension and the client will negotiate which HTTP version to use over the ones compatible by the server. By default, it will try to use HTTP/2 first and if it's not enabled, it will use HTTP/1.1. If you want to enable it, you can set:
ja_jp: または、Application-Layer Protocol Negotiation (alpn) TLSエクステンションを有効にすると、クライアントは、サーバーが互換性のあるものよりも、どのHTTPバージョンを使用するかをネゴシエートすることができます。デフォルトでは、まずHTTP/2を使用しようとし、有効になっていない場合はHTTP/1.1を使用します。有効にしたい場合は、以下のように設定します:

source: Alternatively, you can fetch keys from external services, such as link:{vault-guide}[HashiCorp Vault] or other secret managers, by using MicroProfile `ConfigSource` and the `smallrye.jwt.sign.key` and `smallrye.jwt.encrypt.key` properties:
ja_jp: または、リンクなどの外部サービスからキーを取得することもできます。{vault-guide} [HashiCorp Vault] またはその他のシークレットマネージャーでは、MicroProfile の `ConfigSource` と `smallrye.jwt.sign.key` および `smallrye.jwt.encrypt.key` プロパティーを使用します。

source: Alternatively, you can implement the `ResteasyReactiveClientRequestFilter` interface instead of the `ClientRequestFilter` interface that will directly provide the `ResteasyReactiveClientRequestContext` context:
ja_jp: または、 `ClientRequestFilter` インターフェイスの代わりに `ResteasyReactiveClientRequestFilter` インターフェイスを実装して、 `ResteasyReactiveClientRequestContext` コンテキストを直接提供することもできます。

source: Alternatively, you can log in by using the API token:
ja_jp: または、APIトークンを使用してログインすることもできます：

source: Alternatively, you can prefer `X-Forwarded-*` headers using the following configuration in `src/main/resources/application.properties` (note `allow-x-forwarded` instead of `allow-forwarded`):
ja_jp: あるいは、`src/main/resources/application.properties` で以下の設定をすることにより (`allow-forwarded` の代わりに `allow-x-forwarded` であることに注意)、`X-Forwarded-*` ヘッダーを優先することもできます:

source: Alternatively, you can provide your own `JAXBContext` bean by doing:
ja_jp: または、次のようにして、独自の `JAXBContext` Bean を提供できます。

source: Alternatively, you can register clients without even using OIDC. For example, it can be a command line tool which registers clients and passes metadata of the registered clients to Quarkus services which require them.
ja_jp: または、OIDC を使用せずにクライアントを登録することもできます。たとえば、クライアントを登録し、登録されたクライアントのメタデータを必要とする Quarkus サービスにそのメタデータを渡すコマンドラインツールを使用できます。

source: Alternatively, you can run these tests using Maven:
ja_jp: あるいは、Mavenを使用してこれらのテストを実行することもできます：

source: Alternatively, you can set `quarkus.cassandra.init.eager-init` to true: in this case the session bean and all DAO beans will be initialized eagerly during application startup, on the Quarkus main thread. This would eliminate any risk of blocking a Vert.x thread, at the cost of making your startup time (much) longer.
ja_jp: `quarkus.cassandra.init.eager-init` この場合、セッションBeanとすべてのDAO Beanは、アプリケーションの起動時にQuarkusのメインスレッドで、早期初期化されます。これにより、Vert.xスレッドをブロックする危険性がなくなりますが、その分、起動時間が長くなります。

source: Alternatively, you can set `quarkus.cassandra.init.eager-init` to true: in this case the session bean will be initialized eagerly during application startup, on the Quarkus main thread. This would eliminate any risk of blocking a Vert.x thread, at the cost of making your startup time (much) longer.
ja_jp: または、 `quarkus.cassandra.init.eager-init` を true に設定することもできます。この場合には、セッション Bean は、アプリケーションの起動時に、Quarkus メインスレッドで先行して初期化されます。これにより、Vert.x スレッドをブロックするリスクがなくなりますが、起動時間が (はるかに) 長くなります。

source: Alternatively, you can set the `QUARKUS_FUNQY_EXPORT` environment variable when you create the AWS Lambda using the `aws` cli.
ja_jp: または、`aws` cli を使用して AWS Lambda を作成する際に、環境変数 `QUARKUS_FUNQY_EXPORT` を設定することもできます。

source: Alternatively, you can set the `QUARKUS_FUNQY_EXPORT` environment variable when you create the Amazon Lambda using the `aws` cli.
ja_jp: または、 `aws` cli を使用して Amazon Lambda を作成する際に、環境変数 `QUARKUS_FUNQY_EXPORT` を設定することもできます。

source: Alternatively, you can set the `QUARKUS_FUNQY_EXPORT` environment variable when you create the Google Cloud Function using the `gcloud` cli.
ja_jp: あるいは、 `gcloud` cliを使って Google Cloud Function を作成する際に、環境変数 `QUARKUS_FUNQY_EXPORT` を設定することもできます。

source: Alternatively, you can start a Kafka broker in a test resource. The following snippet shows a test resource starting a Kafka broker using https://www.testcontainers.org/modules/kafka/[Testcontainers]:
ja_jp: あるいは、テストリソースで Kafka ブローカを起動することもできます。次のスニペットは、 https://www.testcontainers.org/modules/kafka/[Testcontainers] 使用して Kafka ブローカを起動するテストリソースを示しています。

source: Alternatively, you can supply the configuration name using the <<client-connectors,connector>>:
ja_jp: あるいは、<<client-connectors,コネクター>> を使用して設定名を指定することもできます。

source: Alternatively, you can use `@RunOnVirtualThread` on the class itself:
ja_jp: または、クラス自体で `@RunOnVirtualThread` を使用することもできます。

source: Alternatively, you can use `@io.smallrye.common.annotation.Blocking` and omit the `type = Route.HandlerType.BLOCKING`:
ja_jp: または、 `@io.smallrye.common.annotation.Blocking` を使用して、 `type = Route.HandlerType.BLOCKING` を省略できます。

source: Alternatively, you can use `OidcClientRegistrations` to prepare a new `OidcClientRegistration` and use `OidcClientRegistration` to register a client. For example:
ja_jp: または、 `OidcClientRegistrations` を使用して新しい `OidcClientRegistration` を準備し、 `OidcClientRegistration` を使用してクライアントを登録することもできます。次に例を示します。

source: Alternatively, you can use `OidcRequestFilter.Endpoint` enum to apply this filter to the token endpoint requests only:
ja_jp: あるいは、 `OidcRequestFilter.Endpoint` 列挙型を使用して、このフィルターをトークンエンドポイントリクエストにのみ適用することもできます。

source: Alternatively, you can use `all` to make native-image executable to include all available locales. It inflate the size of the executable substantially though. The difference between including just two or three locales and including all locales is at least 23 MB.
ja_jp: あるいは、 `all` を使って、利用可能なすべてのロケールを含むネイティブイメージの実行可能ファイルを作成することもできます。ただし、実行可能ファイルのサイズが大幅に膨れ上がります。 2つか3つのロケールを含めるのと、すべてのロケールを含めるのとでは、少なくとも23MBの差があります。

source: Alternatively, you can use `kafka.bootstrap.servers` instead of `quarkus.kafka-streams.bootstrap-servers` as you did in the _generator_ project above.
ja_jp: あるいは、上記の _generator_ プロジェクトで行ったように、 `quarkus.kafka-streams.bootstrap-servers` の代わりに `kafka.bootstrap.servers` を使用することができます。

source: Alternatively, you can use a `META-INF/persistence.xml` to set up Hibernate ORM. This is useful for:
ja_jp: また、 `META-INF/persistence.xml` を使用して、Hibernate ORM を設定することもできます。これは次のような場合に便利です:

source: Alternatively, you can use an `@OidcEndpoint` annotation to apply this filter to responses from the OIDC discovery endpoint only:
ja_jp: または、 `@OidcEndpoint` アノテーションを使用して、このフィルターを OIDC 検出エンドポイントからのレスポンスにのみ適用することもできます。

source: Alternatively, you can use the _deprecated_ `quarkus.mailer.trust-store.paths` and `quarkus.mailer.trust-all` properties:
ja_jp: または、_非推奨_ の `quarkus.mailer.trust-store.paths` および `quarkus.mailer.trust-all` プロパティーを使用することもできます。

source: Alternatively, you can use the `@WithTransaction` annotation to start a transaction and commit it when the method returns:
ja_jp: あるいは、 `@WithTransaction` アノテーションを使用してトランザクションを開始し、メソッドが返ったときにコミットすることもできます：

source: Alternatively, you can use the `blocking` attribute from the `@ConsumeEvent` annotation:
ja_jp: あるいは、 `@ConsumeEvent` アノテーションの `blocking` 属性を使用することもできます。

source: Alternatively, you can use the default Quarkus worker pool using:
ja_jp: あるいは、デフォルトの Quarkus ワーカープールを使用することもできます。

source: Alternatively, you can use uri connection by providing a single connection property
ja_jp: または、単一の接続プロパティを指定することで、uri接続を使用することもできます。

source: Alternatively, you may create a `proxy-config.json` as described in <<managing-proxy-classes-app>>.
ja_jp: または、<<managing-proxy-classes-app>> で説明されているように `proxy-config.json` を作成することもできます。

source: Alternatively, you may log in using the API token:
ja_jp: または、APIトークンを使ってログインすることもできます。

source: Alternatively, you may want to request that `UserInfo` is embedded into the internal generated `IdToken` with the `quarkus.oidc.cache-user-info-in-idtoken=true` property - the advantage of this approach is that by default no cached `UserInfo` state will be kept with the endpoint - instead it will be stored in a session cookie. You may also want to consider encrypting `IdToken` in this case if `UserInfo` contains sensitive data, please see <<token-state-manager,Encrypt Tokens With TokenStateManager>> for more information.
ja_jp: また、 `quarkus.oidc.cache-user-info-in-idtoken=true` プロパティーを指定して、 `UserInfo` を内部生成される `IdToken` に埋め込むように要求することもできます。この方法の利点は、デフォルトでは `UserInfo` のキャッシュ状態がエンドポイントに保持されない代わりに、セッション Cookie に保持されることです。また、 `UserInfo` に機密情報が含まれている場合は、 `IdToken` を暗号化することを検討するとよいでしょう。詳細は <<token-state-manager,TokenStateManager によるトークンの暗号化>> を参照してください。

source: Alternatively, you may want to request that `UserInfo` is embedded into the internal generated `IdToken` with the `quarkus.oidc.cache-user-info-in-idtoken=true` property - the advantage of this approach is that by default no cached `UserInfo` state will be kept with the endpoint - instead it will be stored in a session cookie. You may also want to consider encrypting `IdToken` in this case if `UserInfo` contains sensitive data. For more information, see xref:token-state-manager[Encrypt tokens with TokenStateManager].
ja_jp: あるいは、 `UserInfo` が `quarkus.oidc.cache-user-info-in-idtoken=true` プロパティで内部生成された `IdToken` に埋め込まれるように要求することもできます。このアプローチの利点は、デフォルトではキャッシュされた `UserInfo` の状態がエンドポイントに保持されないことです。代わりに、セッション Cookie に保存されます。また、 `UserInfo` に機密データが含まれている場合、このケースで `IdToken` を暗号化することを検討するとよいでしょう。詳細については、 xref:token-state-manager[TokenStateManagerでトークンを暗号化] を参照してください。

source: Alternatively, you might want to consider caching `UserInfo` using a default or custom UserInfo cache provider. For more information, see the xref:security-oidc-bearer-token-authentication.adoc#bearer-token-token-introspection-userinfo-cache[Token Introspection and UserInfo cache] section of the "OpenID Connect (OIDC) Bearer token authentication" guide.
ja_jp: デフォルトまたはカスタムの UserInfo キャッシュプロバイダーを使用して `UserInfo` をキャッシュすることも検討してください。 詳細は、「OpenID Connect (OIDC) ベアラートークン認証」ガイドの xref:security-oidc-bearer-token-authentication.adoc#bearer-token-token-introspection-userinfo-cache[トークンイントロスペクションと UserInfo キャッシュ] セクションを参照してください。

source: Alternatively, you might want to request that `UserInfo` is embedded into the internal generated `IdToken` with the `quarkus.oidc.cache-user-info-in-idtoken=true` property. The advantage of this approach is that, by default, no cached `UserInfo` state will be kept with the endpoint - instead it will be stored in a session cookie. You might also want to consider encrypting `IdToken` in this case if `UserInfo` contains sensitive data. For more information, see <<token-state-manager,Encrypt tokens with TokenStateManager>>.
ja_jp: あるいは、 `quarkus.oidc.cache-user-info-in-idtoken=true` プロパティーを使用して、 `UserInfo` が内部生成された `IdToken` に埋め込まれるようにリクエストすることを推奨します。 このアプローチの利点は、デフォルトでは、キャッシュされた `UserInfo` 状態がエンドポイントに保持されず、代わりにセッションクッキーに保存されることです。 `UserInfo` に機密データが含まれている場合は、このケースで `IdToken` を暗号化することも推奨します。 詳細は、<<token-state-manager,Encrypt tokens with TokenStateManager>> を参照してください。

source: Alternatively, your application can inject a `Multi` in your bean and subscribe to its events as the following example:
ja_jp: または、以下の例のように、アプリケーションで Bean に `Multi` を注入し、そのイベントをサブスクライブすることもできます。

source: Alternatively, your application can inject a `Multi` in your bean, identified with the channel name and subscribe to its events as the following example:
ja_jp: または、次の例のように、アプリケーションで、チャネル名によって識別される `Multi` を Bean に注入し、そのイベントをサブスクライブすることもできます。

source: Alternatives
ja_jp: 代替案

source: Although Mandrel can generate debug symbols and these contain a fair amount of information about object layouts, including what is a pointer field vs a primitive field, this information cannot be used as is to detect memory leaks or find dominator objects. This is because it has no idea what constitutes a root pointer nor how to recursively trace pointers from those roots.
ja_jp: Mandrelはデバッグ・シンボルを生成することができ、これらのシンボルには、ポインタ・フィールドとプリミティブ・フィールドの違いなど、オブジェクトのレイアウトに関するかなりの情報が含まれていますが、この情報をそのまま使用してメモリ・リークを検出したり、ドミネータ・オブジェクトを見つけることはできません。 これは、何がルート・ポインターを構成しているのか、また、それらのルートから再帰的にポインターをたどる方法がわからないためです。

source: Although Quarkus REST provides the same spec compliant behavior as RESTEasy Classic does, it does not include the same exact provider implementations at runtime.
ja_jp: Quarkus REST は RESTEasy Classic と同じ仕様に準拠した動作を提供しますが、実行時にまったく同じプロバイダー実装は含まれません。

source: Although Quarkus can generate an AOT cache file without ever running the production application, the file will not be optimal as the application was never exercised against any load. To alleviate this, Quarkus can use the existing testsuite of tests annotated with `@QuarkusIntegrationTest` to create an AOT cache file. See the xref:getting-started-testing.adoc#generating-an-aot-cache-during-integration-tests[corresponding section] in the Testing Guide for more details.
ja_jp: Quarkus は、本番アプリケーションを一度も実行せずに AOT キャッシュファイルを生成できますが、アプリケーションが何の負荷にもさらされていないため、そのファイルは最適ではありません。これを軽減するため、Quarkus は `@QuarkusIntegrationTest` アノテーションが付与された既存のテストスイートを使用して AOT キャッシュファイルを作成できます。詳細については、テストガイドの xref:getting-started-testing.adoc#generating-an-aot-cache-during-integration-tests[該当セクション] を参照してください。

source: Although Quarkus extensions typically do not honor the default truststore of SunJSSE, it is still practical to use it in some situations. This applies when migrating from legacy technologies or running on a Linux distribution where the SunJSSE truststore is synchronized with the operating system (OS).
ja_jp: Quarkus エクステンションは通常、SunJSSE のデフォルトのトラストストアを尊重しませんが、状況によってはそれを使用することが実用的です。 これは、従来のテクノロジーから移行する場合、または SunJSSE トラストストアがオペレーティングシステム (OS) と同期されている Linux ディストリビューションで実行する場合に適用されます。

source: Although Quarkus offers some unique opportunities for extension performance, extension developers shouldn't forget https://www.linkedin.com/pulse/how-optimize-software-performance-efficiency-subcodevs/[the basics of performance optimization].
ja_jp: Quarkus はエクステンションのパフォーマンスに独自の機会を提供しますが、エクステンション開発者は https://www.linkedin.com/pulse/how-optimize-software-performance-efficiency-subcodevs/[パフォーマンス最適化の基礎] を忘れてはなりません。

source: Although Quarkus primarily uses `.properties` file extension for configuration, the snakeyaml library, which is used for parsing YAML in Quarkus, can also parse JSON structures. This means you can use YAML files with JSON content inside.
ja_jp: Quarkusでは、主に設定に `.properties` ファイル拡張子を使用しますが、QuarkusでYAMLのパースに使用されるsnakeyamlライブラリは、JSON構造もパースできます。つまり、JSONコンテンツを含むYAMLファイルを使用できます。

source: Although RESTEasy Reactive provides the same spec compliant behavior as RESTEasy Classic does, it does not include the same exact provider implementations at runtime.
ja_jp: RESTEasy Reactiveは、RESTEasy Classicと同じ仕様に準拠した動作を提供しますが、実行時に正確に同じプロバイダの実装が含まれているわけではありません。

source: Although RESTEasy Reactive was built from the ground up to do non-blocking IO and serve requests from the event loop threads (thus avoiding the needless usage of worker pool threads) it can effortlessly work with blocking IO and any piece of code that provides a blocking API (such as Hibernate) without blocking the event loop.
ja_jp: RESTEasy Reactive は、ノンブロッキング IO とイベントループスレッドからのリクエストを処理するために一から構築されていますが(そのため、ワーカープールスレッドの不要な使用を避けることができます)、ブロッキング IO と、(Hibernate のような) ブロッキング APIを提供するあらゆるコードをイベントループをブロッキングせずに簡単に動作させることができます。
